In [1]:
import pandas as pd

In [2]:
data = {
    'DateOfBirth': [2002, 2007, 1976, 1976],
    'Name': ["Ravshan", "Gulshan", "Feruza", "Muxiddin"],
    'Temp': [4, 5, 7, 9]
}

df = pd.DataFrame(data)

In [3]:
df

   DateOfBirth      Name  Temp
0         2002   Ravshan     4
1         2007   Gulshan     5
2         1976    Feruza     7
3         1976  Muxiddin     9

In [4]:
df.head()

   DateOfBirth      Name  Temp
0         2002   Ravshan     4
1         2007   Gulshan     5
2         1976    Feruza     7
3         1976  Muxiddin     9

In [5]:
df.head(3)

   DateOfBirth     Name  Temp
0         2002  Ravshan     4
1         2007  Gulshan     5
2         1976   Feruza     7

In [6]:
df.shape

(4, 3)

In [7]:
df.size

12

In [8]:
df = pd.DataFrame(data, columns=['Name', 'Temp', 'DateOfBirth'])

In [9]:
df.head()

       Name  Temp  DateOfBirth
0   Ravshan     4         2002
1   Gulshan     5         2007
2    Feruza     7         1976
3  Muxiddin     9         1976

In [10]:
df = pd.DataFrame(data, columns=['Name', 'Temp', 'DateOfBirth', 'isMarried'])

In [11]:
df.head()

       Name  Temp  DateOfBirth isMarried
0   Ravshan     4         2002       NaN
1   Gulshan     5         2007       NaN
2    Feruza     7         1976       NaN
3  Muxiddin     9         1976       NaN

In [12]:
df = pd.DataFrame(data, columns=['Name', 'Temp', 'DateOfBirth', 'isMarried'], index=[11, 17, 8, 10])

In [13]:
df

        Name  Temp  DateOfBirth isMarried
11   Ravshan     4         2002       NaN
17   Gulshan     5         2007       NaN
8     Feruza     7         1976       NaN
10  Muxiddin     9         1976       NaN

In [14]:
ismlar = df['Name']

In [15]:
type(ismlar)

pandas.core.series.Series

In [16]:
df.DateOfBirth

11    2002
17    2007
8     1976
10    1976
Name: DateOfBirth, dtype: int64

In [17]:
df['isMarried'] = False

In [18]:
df

        Name  Temp  DateOfBirth  isMarried
11   Ravshan     4         2002      False
17   Gulshan     5         2007      False
8     Feruza     7         1976      False
10  Muxiddin     9         1976      False

In [19]:
val = pd.Series([True, True], index=[8, 10])
df.isMarried = val

In [20]:
df

        Name  Temp  DateOfBirth isMarried
11   Ravshan     4         2002       NaN
17   Gulshan     5         2007       NaN
8     Feruza     7         1976      True
10  Muxiddin     9         1976      True

In [21]:
df['5+'] = df.Temp > 5

In [22]:
df

        Name  Temp  DateOfBirth isMarried     5+
11   Ravshan     4         2002       NaN  False
17   Gulshan     5         2007       NaN  False
8     Feruza     7         1976      True   True
10  Muxiddin     9         1976      True   True

In [23]:
df

        Name  Temp  DateOfBirth isMarried     5+
11   Ravshan     4         2002       NaN  False
17   Gulshan     5         2007       NaN  False
8     Feruza     7         1976      True   True
10  Muxiddin     9         1976      True   True

In [24]:
del df['5+']

In [25]:
df

        Name  Temp  DateOfBirth isMarried
11   Ravshan     4         2002       NaN
17   Gulshan     5         2007       NaN
8     Feruza     7         1976      True
10  Muxiddin     9         1976      True

In [26]:
val = pd.Series([False, False, True, True], index=[11, 17, 8, 10])
df['isMarried'] = val

In [27]:
df

        Name  Temp  DateOfBirth  isMarried
11   Ravshan     4         2002      False
17   Gulshan     5         2007      False
8     Feruza     7         1976       True
10  Muxiddin     9         1976       True

In [28]:
df['Name'].name = 'Ism'

In [29]:
df['Name']

11     Ravshan
17     Gulshan
8       Feruza
10    Muxiddin
Name: Ism, dtype: object

In [30]:
data = {
    'Uzbekistan':{2021:33.9, 2020:33.5, 2019:32.9, 2018:32.5, 2017:31.9},
    'Kazakhstan':{2021:18.9, 2020:18.7, 2019:18.5, 2018:18.3, 2017:18.1, 2016:17.8}
}
df = pd.DataFrame(data)

In [31]:
df

      Uzbekistan  Kazakhstan
2021        33.9        18.9
2020        33.5        18.7
2019        32.9        18.5
2018        32.5        18.3
2017        31.9        18.1
2016         NaN        17.8

In [32]:
df.index.name = 'Yil'

In [33]:
df

      Uzbekistan  Kazakhstan
Yil
2021        33.9        18.9
2020        33.5        18.7
2019        32.9        18.5
2018        32.5        18.3
2017        31.9        18.1
2016         NaN        17.8

In [34]:
df = pd.DataFrame(data, index=[2021, 2019, 2017])

In [35]:
df

      Uzbekistan  Kazakhstan
2021        33.9        18.9
2019        32.9        18.5
2017        31.9        18.1

In [36]:
df.T

            2021  2019  2017
Uzbekistan  33.9  32.9  31.9
Kazakhstan  18.9  18.5  18.1

In [37]:
arr = df.values

In [38]:
arr

array([[33.9, 18.9],
       [32.9, 18.5],
       [31.9, 18.1]])

In [39]:
type(arr)

numpy.ndarray

Indekslar haqida

In [40]:
df

      Uzbekistan  Kazakhstan
2021        33.9        18.9
2019        32.9        18.5
2017        31.9        18.1

In [41]:
df.index

Int64Index([2021, 2019, 2017], dtype='int64')

In [42]:
df.columns

Index(['Uzbekistan', 'Kazakhstan'], dtype='object')

In [43]:
indeks = df.index

In [44]:
indeks

Int64Index([2021, 2019, 2017], dtype='int64')

In [45]:
'Temp' in indeks

False

In [46]:
'Tajikistan' in df.columns

False

In [47]:
2021 in df.index

True

In [48]:
indeks[0]

2021

In [49]:
indeks[::2]

Int64Index([2021, 2017], dtype='int64')

In [50]:
indeks[:]

Int64Index([2021, 2019, 2017], dtype='int64')